Revit 2024 API
ExporterIFC.ExportBaseQuantities Property
 Identifies if the export should include IFC standard quantities currently supported by Revit.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public bool ExportBaseQuantities { get; }
Visual Basic
Public ReadOnly Property ExportBaseQuantities As Boolean
	Get
Visual C++
public:
property bool ExportBaseQuantities {
	bool get ();
}
See Also
ExporterIFC Class
Autodesk.Revit.DB.IFC Namespace